app/controllers/blog_posts_controller.rb

SELECT  "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_blog_post
    @blog_post = BlogPost.find(params[:id])