app/controllers/pages_controller.rb

  def home
    @projects = Project.all
    @posts = BlogPost.all
---
SELECT "projects".* FROM "projects"
SELECT "blog_posts".* FROM "blog_posts"